Revit 2025 API
ParameterTypeId.RebarShapeHookRotationAtEnd Property
 "Hook Rotation At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarShapeHookRotationAtEnd { get; }
Public Shared ReadOnly Property RebarShapeHookRotationAtEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeHookRotationAtEnd {
	ForgeTypeId^ get ();
}
static member RebarShapeHookRotationAtEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace